Revit 2024 API
FabricArea.MinorLapSpliceLength Property
 The fabric lap splice length in the fabric distribution in the minor direction.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public double MinorLapSpliceLength { get; set; }
Visual Basic
Public Property MinorLapSpliceLength As Double
	Get
	Set
Visual C++
public:
property double MinorLapSpliceLength {
	double get ();
	void set (double value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  When setting this property: minorLapSpliceLength is greater than the half of the overall width.
See Also
FabricArea Class
Autodesk.Revit.DB.Structure Namespace